lib/tasks/adding_comments.rake

SELECT "blogs".* FROM "blogs"
INSERT INTO "comments" ("comment_title", "comment_text", "is_delete", "created_at", "updated_at", "blog_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  task adding_comments: :environment do
    h = Blog.all
    h.each do |b|
      b.comments.create(
        comment_title: "From rake task",
        comment_text:  "from rake task"
        )