lib/tasks/my_namespace.rake

  task my_task1: :environment do

    require 'csv'

    file = "#{Rails.root}/public/blog_data.csv"

    comments = Comment.where(is_delete: false)

    headers = ["Blog ID", "Title", "Body", "Comment_id", "comment_title", "comment_text"]

    CSV.open(file, 'w', write_headers: true, headers: headers) do |b|
      comments.each do |c|
---
SELECT "comments".* FROM "comments" WHERE "comments"."is_delete" = $1  [["is_delete", false]]