lib/tasks/parsing_csv.rake

INSERT INTO "blogs" ("title", "body", "view_count", "published_date", "is_active", "is_delete", "created_at", "updated_at", "blog_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "comments" ("comment_title", "comment_text", "is_delete", "created_at", "updated_at", "blog_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  task parsing_csv: :environment do

    csv_text = File.read('public/demo_filetest.csv')
    csv = CSV.parse(csv_text, headers: true)
    (0..(csv.count - 1)).each do |index|

      blogs = Blog.create({

        title: csv[index]['blog_title'],
        body: csv[index]['body'],
        published_date: csv[index]['publish_date']
      })

      blogs.comments.create({

        comment_title: csv[index]['comment_title'],
        comment_text: csv[index]['comment_text']
      })