app/controllers/concerns/CommentConcerns/CommentController.rb

INSERT INTO "comments" ("comment_title", "comment_text", "is_delete", "created_at", "updated_at", "blog_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
      def create
        comment = Comment.new(comment_params)
        if comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "comments" SET "comment_text" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["comment_text", "ABCDEFGHIJKLMNOPQRST"], ["updated_at", "2022-07-01 10:21:24.836147"], ["id", 3]]
---
      def update
        comment = Comment.find(comment_params[:id])
        if comment.update(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
      def show
        comment = Comment.find(params[:id])

SELECT "blogs".* FROM "blogs" WHERE "blogs"."title" = $1 LIMIT $2  [["title", "fefewdwdewdedwfeeTal"], ["LIMIT", 1]]
SELECT 1 AS one FROM "blogs" WHERE "blogs"."title" = $1 LIMIT $2  [["title", "fefewdwdewdedwfeeTal"], ["LIMIT", 1]]
SELECT "blogs".* FROM "blogs" WHERE "blogs"."title" = $1 LIMIT $2  [["title", "Mikhail Tal"], ["LIMIT", 1]]
INSERT INTO "comments" ("comment_title", "comment_text", "is_delete", "created_at", "updated_at", "blog_id", "news_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "blogs" ("title", "body", "view_count", "published_date", "is_active", "is_delete", "created_at", "updated_at", "blog_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "blogs" SET "updated_at" = $1 WHERE "blogs"."id" = $2  [["updated_at", "2022-07-07 14:00:20.200161"], ["id", 126]]
---
      def comment_with_blog
          bblog = Blog.find_by(title: params[:title])
          if bblog.present?
            comment = bblog.comments.new(comment_params)
            if comment.save
              send_response(1, 200, "Comment is created", ActiveModelSerializers::SerializableResource.new(comment))
            else
              send_response(1, 200, "Something went wrong",{})
            end

          else
            blog = Blog.new(blog_params)
            blog.image.attach(blog_params[:image])
              if blog.save
                #send_response(1, 200, "Blog Created", ActiveModelSerializers::SerializableResource.new(blog))
              #else
                #send_response(0,404,"Something went wrong",{})
              #end
              comment = blog.comments.new(comment_params)
              if comment.save

SELECT "blogs".* FROM "blogs" WHERE "blogs"."title" = $1 LIMIT $2  [["title", "Testing demo solution"], ["LIMIT", 1]]
SELECT 1 AS one FROM "blogs" WHERE "blogs"."title" = $1 LIMIT $2  [["title", "Mikhail Tal harsh patel123456"], ["LIMIT", 1]]
SELECT "blogs".* FROM "blogs" WHERE "blogs"."title" = $1 LIMIT $2  [["title", "Mikhail Tal harsh patel123"], ["LIMIT", 1]]
INSERT INTO "comments" ("comment_title", "comment_text", "is_delete", "created_at", "updated_at", "blog_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comment_title", "Comment_title"], ["comment_text", "fewfewfwef"], ["is_delete", false], ["created_at", "2022-07-11 07:01:38.604708"], ["updated_at", "2022-07-11 07:01:38.604708"], ["blog_id", 3]]
UPDATE "blogs" SET "updated_at" = $1 WHERE "blogs"."id" = $2  [["updated_at", "2022-07-07 15:48:55.127411"], ["id", 140]]
INSERT INTO "blogs" ("title", "body", "view_count", "published_date", "is_active", "is_delete", "created_at", "updated_at", "blog_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "comments" ("comment_title", "comment_text", "is_delete", "created_at", "updated_at", "blog_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
      def solution
        blog = Blog.find_by(title: params[:title])
        if blog.present?
          comment = blog.comments.new(comment_params)
          if comment.save
              send_response(1, 200, "Comment is created", ActiveModelSerializers::SerializableResource.new(blog))
            else
              send_response(1, 200, "Something went wrong",{})
            end

        else
          blog = Blog.new(blog_params)
          if blog.save
            comment = blog.comments.new(comment_params)
            if comment.save

INSERT INTO "blogs" ("title", "body", "view_count", "published_date", "is_active", "is_delete", "created_at", "updated_at", "blog_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
      def nested_attribute
        blog = Blog.find_or_create_by(blog_params)