app/services/UserService/user_reader.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
      user = User.find(user_params[:id])