app/services/UserService/user_creator.rb

INSERT INTO "users" ("name", "username", "email", "phone", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
      user = User.new(user_params)
      if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2, "password_digest" = $3 WHERE "users"."id" = $4  [["username", "Service12345"], ["updated_at", "2022-06-30 14:15:07.446594"], ["password_digest", "[FILTERED]"], ["id", 7]]
---
    def update
      user = User.find(user_params[:id])
      if user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 9]]
---
    def destroy
      User.destroy(user_params[:id])