app/services/BlogService/blog_reader.rb

    def show
      blog = Blog.find(@params[:id])
      blog.increment!(:blog_count)

      if blog.like.present?
        blog.like.increment!(:like_count)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "blogs" SET "blog_count" = COALESCE("blog_count", 0) + $1 WHERE "blogs"."id" = $2  [["blog_count", 1], ["id", 96]]
UPDATE "likes" SET "like_count" = COALESCE("like_count", 0) + $1 WHERE "likes"."id" = $2  [["like_count", 1], ["id", 1]]