app/services/BlogService/blog_creator.rb

INSERT INTO "blogs" ("title", "body", "view_count", "published_date", "is_active", "is_delete", "created_at", "updated_at", "blog_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "blogs" ("title", "body", "view_count", "published_Date", "is_active", "is_delete", "created_at", "updated_at", "image", "blog_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
      blog = Blog.new(blog_params)
      blog.image.attach(blog_params[:image])
      if blog.save

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 198], ["LIMIT", 1]]
UPDATE "blogs" SET "updated_at" = $1 WHERE "blogs"."id" = $2  [["updated_at", "2022-07-04 14:03:44.689520"], ["id", 31]]
---
    def update
      blog = Blog.find(blog_params[:id])
      if blog.update(blog_params)