app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def authenticate_request

    if request.headers["Authorization"].present?
      header = request.headers["Authorization"]
      decoded = jwt_decode(header)
      @current_user = User.find(decoded[:user_id])