app/controllers/blogs_controller.rb

  def create
    res,blog = BlogService::BlogCreator.new(blog_params).create
---
INSERT INTO "blogs" ("title", "body", "view_count", "published_date", "is_active", "is_delete", "created_at", "updated_at", "blog_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def add_like
    blog = Blog.find_by(id: params[:id])
    blog.increment!(:like_count)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "like_count" = COALESCE("like_count", 0) + $1 WHERE "blogs"."id" = $2  [["like_count", 1], ["id", 206]]