app/controllers/news_controller.rb

   def index
    news = News.all
    news = news.paginate(page: params[:page], per_page: 3)
    page_no = params[:page].present? ? params[:page] : DEFAULT_PAGE
    per_page = params[:per_page].present? ? params[:per_page] : PER_PAGE_RECORDS
    meta = prepare_meta(news, total_record_count: news.count, page_no: page_no, per_page: per_page)
---
SELECT "news".* FROM "news"
SELECT "news".* FROM "news" LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "news"

    def create
      news = News.new(news_params)
      if news.save
---
INSERT INTO "news" ("news_title", "news_body", "published_date", "like_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
      news = News.find(news_params[:id])
      if news.update(news_params)
---
SELECT "news".* FROM "news" WHERE "news"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "news" SET "news_title" = $1, "updated_at" = $2 WHERE "news"."id" = $3  [["news_title", "Ind vs Eng Odi 2"], ["updated_at", "2022-07-13 06:07:47.213870"], ["id", 2]]

    def show
      news = News.find(params[:id])
---
SELECT "news".* FROM "news" WHERE "news"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def destroy
      news = News.find(params[:id])
      if news.present?
      news.destroy
---
SELECT "news".* FROM "news" WHERE "news"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "news" WHERE "news"."id" = $1  [["id", 4]]

    def add_like
      news = News.find_by(id: params[:id])
      news.increment!(:like_count)
---
SELECT "news".* FROM "news" WHERE "news"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "news" SET "like_count" = COALESCE("like_count", 0) + $1 WHERE "news"."id" = $2  [["like_count", 1], ["id", 2]]