app/controllers/sneakers_controller.rb

INSERT INTO "sneakers" ("company", "name", "size", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["company", "Puma"], ["name", "RS X3"], ["size", 11], ["price", 8000], ["created_at", "2022-07-07 06:41:56.250884"], ["updated_at", "2022-07-07 06:41:56.250884"], ["user_id", 3]]
---
  def create
    sneaker = @current_user.sneakers.new(sneaker_params)
    if sneaker.save

SELECT "sneakers".* FROM "sneakers" WHERE "sneakers"."user_id" = $1 AND "sneakers"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
SELECT "sneakers".* FROM "sneakers" WHERE "sneakers"."user_id" = $1 AND "sneakers"."id" = $2 LIMIT $3  [["user_id", 3], ["id", nil], ["LIMIT", 1]]
UPDATE "sneakers" SET "name" = $1, "updated_at" = $2 WHERE "sneakers"."id" = $3  [["name", "Air Force-2"], ["updated_at", "2022-07-07 09:26:01.650518"], ["id", 7]]
---
  def update
      sneaker = @current_user.sneakers.find_by(id: params[:id])
      if sneaker.present?
        if sneaker.update(sneaker_params)

SELECT "sneakers".* FROM "sneakers" WHERE "sneakers"."user_id" = $1 AND "sneakers"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 2], ["LIMIT", 1]]
---
  def show
    sneakers = @current_user.sneakers.find(params[:id])

SELECT "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "sneakers".* FROM "sneakers" WHERE "sneakers"."user_id" = $1 AND "sneakers"."id" = $2 LIMIT $3  [["user_id", 8], ["id", 6], ["LIMIT", 1]]
DELETE FROM "sneakers" WHERE "sneakers"."id" = $1  [["id", 3]]
---
  def destroy
    sneaker = @current_user.sneakers.find_by(id: params[:id])
    if sneaker.present?
      sneaker.destroy(params[:id])