app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "email", "phone", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "username" = $1, "updated_at" = $2, "password_digest" = $3 WHERE "users"."id" = $4  [["username", "Service12345"], ["updated_at", "2022-06-30 14:15:07.446594"], ["password_digest", "[FILTERED]"], ["id", 7]]
---
  def update
    unless @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_users
      @user = User.find(params[:id])