app/services/NewsService/news_creator.rb

INSERT INTO "news" ("title", "body", "published_date", "news_count", "is_active", "is_delete", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
      news = News.new(news_params)
      news.image.attach(news_params[:image])
      if news.save

UPDATE "news" SET "updated_at" = $1 WHERE "news"."id" = $2  [["updated_at", "2022-07-06 10:13:46.605525"], ["id", 2]]
---
    def update
      news = News.find(@params[:id])
      if news.update(news_params)