app/services/NewsService/news_reader.rb

SELECT "news".* FROM "news" WHERE "news"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "news" SET "news_count" = COALESCE("news_count", 0) + $1 WHERE "news"."id" = $2  [["news_count", 1], ["id", 12]]
UPDATE "likes" SET "like_count" = COALESCE("like_count", 0) + $1 WHERE "likes"."id" = $2  [["like_count", 1], ["id", 3]]
INSERT INTO "likes" ("like_count", "likeable_id", "likeable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["like_count", 1], ["likeable_id", 17], ["likeable_type", "News"], ["created_at", "2022-07-06 14:59:56.988033"], ["updated_at", "2022-07-06 14:59:56.988033"]]
---
    def show
      news = News.find(@params[:id])
      news.increment!(:news_count)

      if news.like.present?
        news.like.increment!(:like_count)
      else
        news.like = Like.new(like_count: 1)
        news.like.save